ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
        styles_initialized = true;
    }

    // Crear el botón
    lv_obj_t * btn = lv_btn_create(parent);

    // Eliminar estilos previos
    lv_obj_remove_style_all(btn);

    switch (style) {
        case BUTTON_STYLE_PURPLE:
            lv_obj_add_style(btn, &style_purple, 0);
            break;
        case BUTTON_STYLE_BLUE:
            lv_obj_add_style(btn, &style_blue, 0);
            break;
        case BUTTON_STYLE_ORANGE:
            lv_obj_add_style(btn, &style_orange, 0);
            break;
        case BUTTON_STYLE_GREEN:
            lv_obj_add_style(btn, &style_green, 0);
            break;
    }

    // Aplicar estilos comunes a todos los botones
    lv_obj_add_style(btn, &style_btn_pressed, LV_STATE_PRESSED);
    lv_obj_add_style(btn, &style_btn, 0);

    // Aplicar la etiqueta al botón
    lv_obj_set_parent(label, btn);
    lv_obj_center(label);

    // Configurar tamaño del botón
    lv_obj_set_size(btn, 50, 50);

    // Configurar la posición modificable del botón
    lv_obj_set_pos(btn, pos_x, pos_y);

    // Evento de presionado
    lv_obj_add_event_cb(btn, event_cb, LV_EVENT_CLICKED, NULL);
}







//--------------------------------------PESTAÑA 1---------------------------------------------------
// Pantalla principal de la pestaña 1 (es dinámica y está sincronizada con la base de datos
void tab1_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "¡BIENVENIDO!", TITLE_STYLE_PURPLE);

    // Obtener los datos de los libros de la base de datos
    DynamicJsonDocument doc = get_book_data();

    // Variable para almacenar el total de páginas leídas
    int total_pages = 0;

    // Recorrer los datos obtenidos y sumar las páginas leídas
    for(JsonPair kv : doc.as<JsonObject>()) {
        currentPage = kv.value()["pagina_actual"].as<int>();
        total_pages += currentPage; // Suma las páginas actuales al total
    }

    // Crear una etiqueta para mostrar el nivel de lector
    lv_obj_t * label = lv_label_create(parent);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_recolor(label, true);
    lv_obj_set_style_text_font(label, &ubuntu_bold_16, 0);
    lv_obj_set_width(label, 220);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label, LV_ALIGN_CENTER, 0, -65);

    // Determinar el nivel de lector en función del total de páginas leídas
    String reader_level;
    if (total_pages < 200) {
        reader_level = "#8000C4 LECTOR NIVEL 0#";
    } else if (total_pages < 400) {
        reader_level = "#8000C4 LECTOR NIVEL 1#";
    } else if (total_pages < 600) {
        reader_level = "#8000C4 LECTOR NIVEL 2#";
    } else if (total_pages < 800) {
        reader_level = "#8000C4 LECTOR NIVEL 3#";
    } else if (total_pages < 1500) {
        reader_level = "#8000C4 LECTOR NIVEL 4#";
    } else {
        reader_level = "#8000C4 LECTOR NIVEL MÁXIMO#";
    }

    // Configurar la etiqueta con el nivel de lector
    lv_label_set_text(label, reader_level.c_str());

    // Texto de bienvenida
    lv_obj_t * label1 = lv_label_create(parent);
    lv_label_set_long_mode(label1, LV_LABEL_LONG_WRAP); // si el texto es muy largo se pasa a la línea siguiente
    lv_label_set_text(label1, "Yo seré tu asistente de lectura :)\n\n¿Quieres saber cómo funciono?");
    lv_obj_set_style_text_font(label1, &ubuntu_regular_16, 0);
    lv_obj_set_width(label1, 200);
    lv_obj_set_style_text_align(label1, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label1, LV_ALIGN_CENTER, 0, 10);

    // Botón con símbolo para ir a la pantalla secundaria de la pestaña 1
    lv_obj_t * symbol = lv_label_create(parent);
    lv_label_set_text(symbol, "\xF3\xB0\xB3\xBD");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(parent, symbol, BUTTON_STYLE_PURPLE, go_to_screen2_tab1, 75, 200);
}

// Nueva pantalla con información adicional sobre el funcionamiento de la interfaz de usuario
void create_second_screen_tab1(lv_obj_t * parent) {
    lv_obj_t * screen2 = lv_obj_create(NULL); // Objeto que se utilizará para cargar la nueva pantalla
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xE9AAFF), 0);
    lv_scr_load(screen2); // Cargar la nueva pantalla

    // Definir los textos de las etiquetas y sus posiciones Y en un array
    const char * textos[] = {
            "#8035A8 ¡HOLA!# " "#8035A8 \xEE\xAD\x94#",
            "Soy una herramienta para que puedas registrar de manera interactiva tus lecturas a través de mi cámara",
            "Además, te ayudaré a seguir tu progreso con niveles de lector:",
            "#5E0091 Lector nivel 0:# menos de 200 páginas leídas",
            "#5E0091 Lector nivel 1:# entre 200 y 400 páginas leídas",
            "#5E0091 Lector nivel 2:# entre 400 y 600 páginas leídas",
            "#5E0091 Lector nivel 3:# entre 600 y 800 páginas leídas",
            "#5E0091 Lector nivel 4:# entre 800 y 1500 páginas leídas",
            "#5E0091 Lector nivel máximo:# más de 1500 páginas leídas",
            "---------------------------------------",
            "\xF3\xB1\x89\x9F",
            "Aquí podrás almacenar los libros que estés leyendo",
            "\xF3\xB0\x81\xB2",
            "Aquí podrás registrar tus nuevos libros. Para ello deberás mostrar a la cámara el QR asignado a cada libro",
            "\xF3\xB0\x84\xA8",
            "Aquí podrás comprobar tu avance con la lectura"
    };
    const int posicionesY[] = {20, 60, 160, 230, 275, 320, 365, 410, 455, 500, 525, 555, 620, 650, 755, 785};

    // Crear y configurar las etiquetas en un bucle
    for(int i = 0; i < sizeof(textos) / sizeof(textos[0]); i++) {
        lv_obj_t *label = lv_label_create(screen2);
        lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
        lv_label_set_recolor(label, true);
        lv_label_set_text(label, textos[i]);
        lv_obj_set_style_text_font(label, &ubuntu_regular_16, 0);
        lv_obj_set_width(label, 215);
        lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label, LV_ALIGN_TOP_MID, 0, posicionesY[i]);

        // Aplicar la fuente más grande a las etiquetas con símbolos
        if(i == 0 || i == 10 || i == 12 || i == 14) {
            lv_obj_set_style_text_font(label, &bigger_symbols, 0);
        }
    }

    // Botón con símbolo para ir a la pantalla principal de la pestaña 1
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_PURPLE, back_to_main_menu, 95, 850);

    lv_obj_t * space = lv_label_create(screen2);
    lv_label_set_text(space, "\n\n");
    lv_obj_align(space, LV_ALIGN_TOP_MID, 0, 610);
}

// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab1
void go_to_screen2_tab1(lv_event_t * e) {
    lv_obj_t * main_screen = lv_scr_act(); //Obtener la pantalla principal (donde están las tabs)
    scr_principal = main_screen; //Guardar la pantalla principal en una variable global
    create_second_screen_tab1(main_screen); //Cargar la pantalla secundaria
}






//--------------------------------------PESTAÑA 2---------------------------------------------------
// Generación de estructura para hacer más fácil el manejo de los libros para ordenarlos
struct Book {
    String title;
    String book_key;
    long long timestamp;
};

