ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
// Pantalla principal de la pestaña 2 (es dinámica y está sincronizada con la base de datos)
void tab2_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "MIS LIBROS", TITLE_STYLE_BLUE);

    // Crear la lista donde se mostrarán los libros
    lv_obj_t * list = lv_list_create(parent);

    // Estilo para la lista
    static lv_style_t style_blue;
    lv_style_init(&style_blue);
    lv_style_set_bg_color(&style_blue, lv_color_hex(0xCBECFF));
    lv_style_set_border_width(&style_blue, 0);
    lv_style_set_border_color(&style_blue, lv_color_make(10, 154, 254));
    lv_style_set_radius(&style_blue, 1);

    // Aplicar el estilo a la lista
    lv_obj_add_style(list, &style_blue , LV_STATE_DEFAULT);

    // Obtener los datos de los libros de la base de datos
    DynamicJsonDocument doc = get_book_data();
    if (!doc.isNull()) {
        // Obtener el número de libros y calcular la altura de la lista
        int num_books = doc.as<JsonObject>().size();
        int list_height = num_books * 40;
        lv_obj_set_size(list, 230, list_height);
        lv_obj_align(list, LV_ALIGN_TOP_MID, 0, 55);

        // Vector para almacenar los libros (vector dinámico)
        std::vector<Book> books;

        // Recorrer los datos obtenidos y crear un objeto Book para cada libro
        for(JsonPair kv : doc.as<JsonObject>()) {
            book_key = kv.key().c_str();
            title = kv.value()["titulo"].as<String>();
            timestamp = kv.value()["ultima_modificacion"].as<long long>();

            Book book = {title, book_key, timestamp};
            books.push_back(book); // va añadiendo los libros al vector
        }

        // Ordenar los libros por timestamp en orden descendente
        std::sort(books.begin(), books.end(), [](const Book & a, const Book & b) {
            return a.timestamp > b.timestamp;
        });

        // Mostrar los libros en la lista
        for (const Book & book : books) {
            char * titleCopy = new char[book.title.length() + 1]; // Reservar espacio para una copia del título del libro, incluyendo espacio para el carácter nulo de terminación
            strcpy(titleCopy, book.title.c_str()); // Copiar el título del libro a la nueva memoria reservada
            char * keyCopy = new char[book.book_key.length() + 1]; // Reservar espacio para una copia de la clave del libro, incluyendo espacio para el carácter nulo de terminación
            strcpy(keyCopy, book.book_key.c_str()); // Copiar la clave del libro a la nueva memoria reservada
            lv_obj_t * btn = lv_list_add_btn(list, "\xF3\xB1\x81\xAF", titleCopy); // Crear un botón en la lista con el título del libro

            // Configurar el estilo del botón
            lv_obj_t * label = lv_obj_get_child(btn, 0);
            lv_obj_set_style_text_font(label, &bigger_symbols, 0);

            lv_obj_set_style_text_font(btn, &ubuntu_regular_16, 0);
            lv_obj_set_style_text_color(btn, lv_color_black(), 0);
            lv_obj_set_style_bg_color(btn, lv_color_hex(0xCBECFF), 0);

            // Agregar un manejador de eventos al botón para que llame a go_to_screen2_tab2 cuando se haga clic en él
            lv_obj_add_event_cb(btn, go_to_screen2_tab2, LV_EVENT_CLICKED, keyCopy); // Use the char* version of the key
        }
    } else {
        Serial.println("Fallo al recuperar datos.");
    }

}

// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab2
void go_to_screen2_tab2(lv_event_t * e) {
    // Obtener la pantalla principal (donde están las tabs)
    lv_obj_t * main_screen = lv_scr_act();
    scr_principal = main_screen;

    // Obtener la clave del libro desde el evento
    /* Se obtiene el dato de usuario asociado al evento 'e' mediante la función 'lv_event_get_user_data(e)'
       Esta función devuelve un puntero a 'void', por lo que se utiliza 'static_cast<char*>' para convertirlo a un puntero a 'char'
       Finalmente, se utiliza el constructor de 'std::string' para convertir el puntero a 'char' en una cadena de caracteres
       El resultado se almacena en la variable 'key' */
    std::string key = static_cast<char*>(lv_event_get_user_data(e));

    // Llamar a la función para crear la segunda pantalla pasando la key del libro seleccionado de la lista
    create_second_screen_tab2(main_screen, key);
}


// Crear la pantalla secundaria de la pestaña 2 con los detalles del libro seleccionado
void create_second_screen_tab2(lv_obj_t * parent, const std::string & key) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xCBECFF), 0);
    lv_scr_load(screen2);

    // Decoración con símbolos arriba y abajo de la pantalla
    lv_obj_t * label_symbols1 = lv_label_create(screen2);
    String symbols = "";
    for(int i = 0; i < 9; i++) {
        symbols += " \xEE\xB7\xA2  ";
    }
    lv_label_set_text(label_symbols1, symbols.c_str());
    lv_obj_set_style_text_font(label_symbols1, &ubuntu_regular_16, 0);
    lv_obj_set_pos(label_symbols1, 0, 10);

    lv_obj_t * label_symbols2 = lv_label_create(screen2);
    lv_label_set_text(label_symbols2, symbols.c_str());
    lv_obj_set_style_text_font(label_symbols2, &ubuntu_regular_16, 0);
    lv_obj_set_pos(label_symbols2, 0, 290);

    int posY = -120;

    // Obtener los datos del libro seleccionado de la base de datos
    DynamicJsonDocument doc = get_book_data(key);
    if (!doc.isNull()) {
        title = doc["titulo"].as<String>();
        author = doc["autor"].as<String>();
        totalPages = doc["paginas_total"].as<int>();
        currentPage = doc["pagina_actual"].as<int>();

        // Crear las etiquetas y mostrar los datos del libro
        lv_obj_t * label_title = lv_label_create(screen2);
        lv_label_set_long_mode(label_title, LV_LABEL_LONG_SCROLL_CIRCULAR);
        lv_obj_set_width(label_title, 225);
        lv_label_set_text(label_title, title.c_str());
        lv_obj_set_style_text_font(label_title, &bigger_symbols, 0);
        lv_obj_set_style_text_align(label_title, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_title, LV_ALIGN_CENTER, 0, posY += 30);

