ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
        lv_obj_t * label_author = lv_label_create(screen2);
        lv_label_set_long_mode(label_author, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label_author, 225);
        lv_label_set_text(label_author, ("Autor: " + author).c_str());
        lv_obj_set_style_text_font(label_author, &ubuntu_regular_16, 0);
        lv_obj_set_style_text_align(label_author, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_author, LV_ALIGN_CENTER, 0, posY += 40);

        lv_obj_t * label_total_pages = lv_label_create(screen2);
        lv_label_set_long_mode(label_total_pages, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label_total_pages, 225);
        lv_label_set_text(label_total_pages, (String(totalPages) + " páginas en total").c_str());
        lv_obj_set_style_text_font(label_total_pages, &ubuntu_italic_16, 0);
        lv_obj_set_style_text_align(label_total_pages, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_total_pages, LV_ALIGN_CENTER, 0, posY += 25);

        lv_obj_t * label_current_page = lv_label_create(screen2);
        lv_label_set_long_mode(label_current_page, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label_current_page, 225);
        lv_label_set_text(label_current_page, ("Vas por la página: " + String(currentPage)).c_str());;
        lv_obj_set_style_text_font(label_current_page, &ubuntu_bold_16, 0);
        lv_obj_set_style_text_align(label_current_page, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_align(label_current_page, LV_ALIGN_CENTER, 0, posY += 25);
    } else {
        Serial.println("Fallo al recuperar datos de Firebase.");
    }

    // Botón con símbolo para volver a la pantalla principal de la pestaña 2
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_BLUE, back_to_main_menu, 95, 210);
}






//--------------------------------------PESTAÑA 3---------------------------------------------------
// Pantalla principal de la pestaña 3 (es estática)
void tab3_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "ESCANEAR LIBRO", TITLE_STYLE_ORANGE);

    // Texto explicativo
    lv_obj_t * label = lv_label_create(parent);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label, "¿Quieres actualizar la página en la que te has quedado?\n\nPincha en el botón para abrir la cámara y escanear el libro");
    lv_obj_set_style_text_font(label, &ubuntu_regular_16, 0);
    lv_obj_set_width(label, 220);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label, LV_ALIGN_CENTER, 0, -10);

    // Botón con símbolo para ir a la pantalla secundaria de la pestaña 3 (escanear QR)
    lv_obj_t * symbol = lv_label_create(parent);
    lv_label_set_text(symbol, "\xF3\xB0\x84\x84");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(parent, symbol, BUTTON_STYLE_ORANGE, go_to_screen2_tab3, 75, 190);
}


// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab3
void go_to_screen2_tab3(lv_event_t * e) {
    lv_obj_t * main_screen = lv_scr_act(); // Obtener la pantalla principal (donde están las tabs)
    scr_principal = main_screen; // Guardar la pantalla principal en una variable global
    create_second_screen_tab3(main_screen); // Cargar la pantalla secundaria (donde se escanea el QR)
}


// Función para crear la pantalla secundaria de la pestaña 3 (escanear QR)
void create_second_screen_tab3(lv_obj_t * parent) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xFFCE7E), 0);
    lv_scr_load(screen2);

    // Activar el lector de códigos QR
    //reader.begin();
    //Serial.println("Begin ESP32QRCodeReader");

    // Verificar si la tarea ya existe antes de intentar crearla
    if (qrCodeTaskHandle == NULL) {
        // Inicia la tarea de escaneo de códigos QR
        Serial.println("Iniciando tarea de escaneo de QR");
        create_qr_task();
    }/* else {
        Serial.println("La tarea de escaneo de QR ya estaba en ejecucion");
        stop_qr_task();
        create_qr_task();
    }*/

    // Crear etiquetas con texto y estilos
    lv_obj_t * label1 = lv_label_create(screen2);
    lv_label_set_long_mode(label1, LV_LABEL_LONG_WRAP);
    lv_label_set_recolor(label1, true);
    lv_label_set_text(label1, "#FF7C00 Muestra el QR del libro a la #FF7C00 cámara#");
    lv_obj_set_style_text_font(label1, &ubuntu_bold_16, 0);
    lv_obj_set_width(label1, 230);
    lv_obj_set_style_text_align(label1, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label1, LV_ALIGN_CENTER, 0, -95);

    // Símbolos decorativos arriba y abajo de la pantalla en cada esquina
    lv_obj_t * label2 = lv_label_create(screen2);
    lv_label_set_recolor(label2, true);
    lv_label_set_text(label2, (String("#FF7C00  \xEE\xAB\x9A                     #" "#FF7C00          \xEE\xAA\xA4#")).c_str());
    lv_obj_set_style_text_font(label2, &bigger_symbols, 0);
    lv_obj_set_pos(label2, 0, 0);

    lv_obj_t * label3 = lv_label_create(screen2);
    lv_label_set_recolor(label3, true);
    lv_label_set_text(label3, (String("#FF7C00  \xEE\xAA\xA4                      #" "#FF7C00         \xEE\xAB\x9A#")).c_str());
    lv_obj_set_style_text_font(label3, &bigger_symbols, 0);
    lv_obj_set_pos(label3, 0, 290);

    // Imagen explicativa
    show_image(screen2);

    // Botón con símbolo para volver a la pantalla principal de la pestaña 3 (si no se desea escanear ningún libro)
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_ORANGE, back_to_main_menu, 95, 340);
}


// Crear la tarea de escaneo de QR
void create_qr_task() {
    if (qr_task_flag == 0) {
        qr_task_flag = 1;
        xTaskCreate(onQrCodeTask, "onQrCode", 4 * 1024, NULL, 4, &qrCodeTaskHandle);
    } else {
        Serial.println("onQrCodeTask is running...");
    }
}


// Detener la tarea de escaneo de QR (espera hasta que la tarea se elimine)
void stop_qr_task() {
    if (qr_task_flag == 1) {
        qr_task_flag = 0;

        while (1) {
            if (eTaskGetState(qrCodeTaskHandle) == eDeleted) {
                break;
            }
            vTaskDelay(100 / portTICK_PERIOD_MS);
        }
        Serial.println("onQrCodeTask deleted!");
    }
}


