ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
// Escanear el código QR, decodificarlo y almacenar el contenido en una variable global
void onQrCodeTask(void *pvParameters) {
    reader.begin();
    Serial.println("Iniciando escaneo de QR");
    Serial.printf("Entrando onQrCodeTask con qr_task_flag = %d\n", qr_task_flag);

    struct QRCodeData qrCodeData;

    // La variable global se limpia bien
    qrCodeContentGlobal = ""; // Limpia de la variable global
    Serial.println("Contenido de la variable global: " + qrCodeContentGlobal);

    //strip.setLedColorData(0, 255, 255, 255); // Color blanco
    //strip.show(); // Actualiza los LEDs

    while (qr_task_flag) {
        // Si se recibe un código QR, decodifica y almacena el contenido en la variable global
        if (reader.receiveQrCode(&qrCodeData, 100)) {
            Serial.println("Found QRCode");

            // Si el código QR es válido, lo guarda en la variable global y
            if (qrCodeData.valid) {
                Serial.print("Payload: ");
                Serial.println((const char *)qrCodeData.payload);

                // Guarda el contenido del código QR en la variable global
                qrCodeContentGlobal = String((const char *)qrCodeData.payload);
                Serial.println("Contenido decodificado " + qrCodeContentGlobal);

                qrCodeFound = true;  // Para entrar en el condicional del loop y poder buscar en la base de datos y mostrar la siguiente pantalla
                qr_task_flag = 0; // Para detener la tarea y luego poder volver a entrar a create_qr_task

                break;

                //strip.setLedColorData(0, 0, 0, 0); // Apaga el LED
                //strip.show(); // Actualiza los LEDs
            } else {
                Serial.print("Invalid: ");
                Serial.println((const char *)qrCodeData.payload);
            }
        }
    }
    Serial.println("Saliendo de onQrCodeTask");
    reader.end();
    TaskHandle_t tmp = qrCodeTaskHandle;
    qrCodeTaskHandle = NULL;
    vTaskDelete(tmp); // Elimina la tarea
}


// Buscar en la base de datos si existe el ISBN decodificado del código QR
void searchIsbnInDatabase(const String & qrCodeContentGlobal) {
    // Guardar el contenido del código QR en una variable
    String qrIsbn = qrCodeContentGlobal;

    // De momento el libro no se ha encontrado
    book_found = false;

    // Crear un documento JSON dinámico para almacenar los datos de los libros
    DynamicJsonDocument doc = get_book_data();

    // Recorrer todos los libros en la base de datos y comparar el ISBN de cada libro con el ISBN decodificado
    for(JsonPair kv : doc.as<JsonObject>()) {
        String isbn = kv.value()["isbn"].as<String>();
        if (isbn == qrIsbn) {
            book_found = true;

            // Almacenar la clave del libro para poder recuperar los datos del libro
            book_key = kv.key().c_str();

            // Almacenar los datos del libro encontrado
            title = kv.value()["titulo"].as<String>();
            author = kv.value()["autor"].as<String>();
            totalPages = kv.value()["paginas_total"].as<int>();
            currentPage = kv.value()["pagina_actual"].as<int>();

            /*
            Serial.println("Libro encontrado:");
            Serial.println("Titulo: " + title);
            Serial.println("Autor: " + author);
            Serial.println("Paginas totales: " + String(totalPages));
            Serial.println("Pagina actual: " + String(currentPage));*/
            break; // Salir del bucle si se encuentra el libro
        }
    }

    // Si no se encontró el libro, imprime "Libro no encontrado"
    if (!book_found) {
        Serial.println("Libro no encontrado");
    }

}


// Crear la pantalla de la pestaña 3 con los datos del libro escaneado para modificar la página actual
void create_keyboard_screen(lv_obj_t * parent) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xFFCE7E), 0);
    lv_scr_load(screen2);



    // Verificar si la tarea ya existe antes de intentar crearla
    /*if (qrCodeTaskHandle != NULL) {
        reader.end();
        //qr_task_flag = 0;
        //qrCodeTaskHandle = NULL;
    }*/

    if(book_found) {
        // Crear etiquetas con los datos del libro
        lv_obj_t * label1 = lv_label_create(screen2);
        lv_label_set_text(label1, title.c_str());
        lv_obj_set_style_text_font(label1, &ubuntu_bold_16, 0);
        lv_obj_align(label1, LV_ALIGN_TOP_MID, 0, 20);

        lv_obj_t * label2 = lv_label_create(screen2);
        lv_label_set_text(label2, author.c_str());
        lv_obj_set_style_text_font(label2, &ubuntu_regular_16, 0);
        lv_obj_align(label2, LV_ALIGN_TOP_MID, 0, 40);

        lv_obj_t * label3 = lv_label_create(screen2);
        lv_label_set_text(label3, (String(totalPages) + " páginas").c_str());
        lv_obj_set_style_text_font(label3, &ubuntu_italic_16, 0);
        lv_obj_align(label3, LV_ALIGN_TOP_MID, 0, 60);

        lv_obj_t * label4 = lv_label_create(screen2);
        lv_label_set_text(label4, ("Página anterior: " + String(currentPage)).c_str());
        lv_obj_set_style_text_font(label4, &ubuntu_regular_16, 0);
        lv_obj_align(label4, LV_ALIGN_TOP_MID, 0, 85);

        lv_obj_t * label5 = lv_label_create(screen2);
        lv_obj_align(label5, LV_ALIGN_TOP_MID, 0, 110);
        lv_label_set_text(label5, "¿En qué página te encuentras?");
        lv_obj_set_style_text_font(label5, &ubuntu_regular_16, 0);

        // Asociación de la etiqueta con el teclado numérico para que cuando el usuario introduzca el número de página, se actualice la etiqueta
        show_numeric_keyboard(label5);
    } else {
        // Si no se encuentra el libro
        lv_obj_t * label = lv_label_create(screen2);
        lv_label_set_text(label, "         LIBRO\n           NO\nENCONTRADO");
        lv_obj_set_style_text_font(label, &bigger_symbols, 0);
        lv_obj_align(label, LV_ALIGN_TOP_MID, 0, 40);

        // Crear botón para regresar a la pantalla principal de la pestaña 3
        lv_obj_t * symbol = lv_label_create(screen2);
        lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
        lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

        create_button(screen2, symbol, BUTTON_STYLE_ORANGE, back_to_main_menu, 95, 160);
    }
}


// Implementación de la función
void show_numeric_keyboard(lv_obj_t * label) {
    // Crear un objeto textarea para almacenar el número introducido por el usuario
    lv_obj_t * ta = lv_textarea_create(lv_scr_act());

    // Establecer el estilo del textarea
    static lv_style_t style_ta;
    lv_style_init(&style_ta);
    lv_style_set_bg_color(&style_ta, lv_color_hex(0xFFF0BE));
    lv_obj_add_style(ta, &style_ta, 0);
    lv_obj_set_size(ta, 100, 40);
    lv_obj_align(ta, LV_ALIGN_TOP_MID, 0, 140);

    // Establecer el texto inicial del textarea a una cadena vacía
    lv_textarea_set_text(ta, "");

    // Crear un mapa de teclado personalizado
    static const char * kb_map[] = {"1", "2", "3", LV_SYMBOL_OK, "\n",
                                    "4", "5", "6", LV_SYMBOL_NEW_LINE, "\n",
                                    "7", "8", "9", LV_SYMBOL_BACKSPACE, "\n",
                                    "0", LV_SYMBOL_LEFT, LV_SYMBOL_RIGHT, NULL
    };

    // Modificar el ancho de los botones
    static const lv_btnmatrix_ctrl_t kb_ctrl[] = {1, 1, 1, 2,
                                                  1, 1, 1, 2,
                                                  1, 1, 1, 2,
                                                  3, 1, 1
    };

    // Crear un teclado numérico personalizado
    lv_obj_t * kb = lv_keyboard_create(lv_scr_act());
    lv_obj_set_size(kb, 240, 130);

