ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
    // Establecer el mapa de teclado personalizado y el modo de teclado
    lv_keyboard_set_map(kb, LV_KEYBOARD_MODE_USER_1, kb_map, kb_ctrl);
    lv_keyboard_set_mode(kb, LV_KEYBOARD_MODE_USER_1);
    lv_keyboard_set_textarea(kb, ta);

    // Establecer el estilo del teclado
    static lv_style_t style_kb;
    lv_style_init(&style_kb);
    lv_style_set_bg_color(&style_kb, lv_color_hex(0xFFF0BE));
    lv_obj_add_style(kb, &style_kb, 0);

    // Registrar la función de devolución de llamada para el evento LV_EVENT_READY
    lv_obj_add_event_cb(kb, keyboard_event_cb, LV_EVENT_READY, label);
}


// Manejar la entrada del usuario en el teclado numérico
// Actualizar la página actual del libro en la base de datos y en la interfaz de usuario
// Limpiar la pantalla
void keyboard_event_cb(lv_event_t * e) {
    // Obtener el teclado, textarea y etiqueta asociados con el evento
    lv_obj_t * kb = lv_event_get_target(e);
    lv_obj_t * ta = lv_keyboard_get_textarea(kb);
    lv_obj_t * label = (lv_obj_t *)lv_event_get_user_data(e);

    // Verificar si el evento es LV_EVENT_READY
    if(lv_event_get_code(e) == LV_EVENT_READY) {
        // Obtener el número de página introducido por el usuario (convertir cadena de caracteres a un int)
        int number = atoi(lv_textarea_get_text(ta));

        // El valor máximo posible a introducir es el máximo de páginas que tiene el libro
        int max_value = totalPages;

        // Verificar si el número introducido es mayor que el número máximo de páginas
        if(number > max_value) {
            std::string max_value_str = std::to_string(max_value); // Convertir el número máximo a una cadena de caracteres
            lv_textarea_set_text(ta, max_value_str.c_str());
            return;
        }

        // Actualizar la variable de página correspondiente al libro actual
        currentPage = number;

        // Actualizar el valor de currentPage en la base de datos
        update_current_page(book_key.c_str(), currentPage);

        // Actualizar la etiqueta con el nuevo valor de la página actual
        std::string buffer = "Página actual: " + std::to_string(number);
        lv_label_set_text(label, buffer.c_str());

        // Limpiar la pantalla
        lv_obj_del(kb);
        lv_obj_del(ta);

        // Crear botón para regresar a la pantalla principal de la pestaña 3
        lv_obj_t * symbol = lv_label_create(lv_scr_act());
        lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
        lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

        create_button(lv_scr_act(), symbol, BUTTON_STYLE_ORANGE, back_to_main_menu, 95, 160);
    }
}






//--------------------------------------PESTAÑA 4---------------------------------------------------
std::vector<std::string> book_keys; // Array para almacenar las claves de los libros (array de cadenas de texto)
int max_pages = 0;
String max_pages_book_title;

// Pantalla principal de la pestaña 4 (es dinámica y está sincronizada con la base de datos)
void tab4_content(lv_obj_t * parent) {
    // Título
    general_title(parent, "MIS ESTADÍSTICAS", TITLE_STYLE_GREEN);

    // Obtener los datos de los libros de la base de datos
    DynamicJsonDocument doc = get_book_data();

    // Variable para almacenar el total de páginas leídas
    int total_pages = 0;

    // Vector para almacenar los libros
    std::vector<Book> books;

    // Crear contenedores para cada estado de los libros (empezado, sin empezar, finalizado)
    lv_obj_t * container_unstarted = lv_obj_create(parent);
    lv_obj_align(container_unstarted, LV_ALIGN_OUT_TOP_LEFT, 0, 290);
    lv_obj_set_size(container_unstarted, 210, 200);
    lv_obj_set_style_bg_color(container_unstarted, lv_color_hex(0xD7ECD5), LV_PART_MAIN);
    lv_obj_set_style_border_color(container_unstarted, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container_unstarted, 2, LV_PART_MAIN);

    lv_obj_t * container_in_progress = lv_obj_create(parent);
    lv_obj_align(container_in_progress, LV_ALIGN_OUT_TOP_LEFT, 0, 565);
    lv_obj_set_size(container_in_progress, 210, 200);
    lv_obj_set_style_bg_color(container_in_progress, lv_color_hex(0xD7ECD5), LV_PART_MAIN);
    lv_obj_set_style_border_color(container_in_progress, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container_in_progress, 2, LV_PART_MAIN);

    lv_obj_t * container_finished = lv_obj_create(parent);
    lv_obj_align(container_finished, LV_ALIGN_OUT_TOP_LEFT, 0, 855);
    lv_obj_set_size(container_finished, 210, 200);
    lv_obj_set_style_bg_color(container_finished, lv_color_hex(0xD7ECD5), LV_PART_MAIN);
    lv_obj_set_style_border_color(container_finished, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container_finished, 2, LV_PART_MAIN);

    // Crear etiquetas para cada contenedor
    lv_obj_t * label_unstarted = lv_label_create(container_unstarted);
    lv_label_set_text(label_unstarted, "LIBROS SIN EMPEZAR");
    lv_obj_set_style_text_font(label_unstarted, &ubuntu_bold_16, 0);
    lv_obj_align(label_unstarted, LV_ALIGN_TOP_LEFT, 0, 0);

    lv_obj_t * label_in_progress = lv_label_create(container_in_progress);
    lv_label_set_text(label_in_progress, "LIBROS A MEDIAS");
    lv_obj_set_style_text_font(label_in_progress, &ubuntu_bold_16, 0);
    lv_obj_align(label_in_progress, LV_ALIGN_TOP_LEFT, 0, 0);

    lv_obj_t * label_finished = lv_label_create(container_finished);
    lv_label_set_text(label_finished, "LIBROS FINALIZADOS");
    lv_obj_set_style_text_font(label_finished, &ubuntu_bold_16, 0);
    lv_obj_align(label_finished, LV_ALIGN_TOP_LEFT, 0, 0);

    // Contadores para cada estado de los libros
    int count_unstarted = 0;
    int count_in_progress = 0;
    int count_finished = 0;

    // Recorrer los datos obtenidos y crear un objeto Book para cada libro
    for(JsonPair kv : doc.as<JsonObject>()) {
        currentPage = kv.value()["pagina_actual"].as<int>();
        totalPages = kv.value()["paginas_total"].as<int>();
        title = kv.value()["titulo"].as<String>();
        book_key = kv.key().c_str();
        timestamp = kv.value()["ultima_modificacion"].as<long long>();

        Book book = {title, book_key, timestamp}; // Crear un objeto Book con los datos del libro
        books.push_back(book); // Añadir el libro al vector

        total_pages += currentPage; // Suma las páginas actuales al total

        // Actualizar el libro con más páginas leídas
        if(currentPage > max_pages) {
            max_pages = currentPage;
            max_pages_book_title = title;
        }

