ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
        // Crear una etiqueta para mostrar el estado de cada libro
        lv_obj_t * status_label = NULL;
        String status_label_text = title;

        // Comprobar estado de cada libro
        if(currentPage == totalPages) {
            status_label = lv_label_create(container_finished);
            lv_obj_align(status_label, LV_ALIGN_TOP_LEFT, 0, 25 * (count_finished + 1));
            count_finished++;
        } else if(currentPage == 0) {
            status_label = lv_label_create(container_unstarted);
            lv_obj_align(status_label, LV_ALIGN_TOP_LEFT, 0, 25 * (count_unstarted + 1));
            count_unstarted++;
        } else {
            float percentage_read = float(currentPage) * 100 / totalPages;
            status_label_text += " (" + String(percentage_read) + "% leído)";
            status_label = lv_label_create(container_in_progress);
            lv_obj_align(status_label, LV_ALIGN_TOP_LEFT, 0, 25 * (count_in_progress + 1));
            count_in_progress++;
        }

        // Configurar la etiqueta con el título del libro
        lv_label_set_text(status_label, status_label_text.c_str());
        lv_obj_set_style_text_font(status_label, &ubuntu_regular_16, 0);
    }

    // Ordenar los libros por timestamp en orden descendente
    std::sort(books.begin(), books.end(), [](const Book & a, const Book & b) {
        return a.timestamp > b.timestamp;
    });

    // El libro más reciente es el primero en el vector
    String most_recent_book_title = books[0].title;

    // Crear una etiqueta para mostrar el libro más reciente
    lv_obj_t * label1 = lv_label_create(parent);
    lv_label_set_long_mode(label1, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label1, "Libro actual");
    lv_obj_set_style_text_font(label1, &ubuntu_bold_16, 0);
    lv_obj_set_width(label1, 230);
    lv_obj_set_style_text_align(label1, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label1, LV_ALIGN_CENTER, 0, -65);

    lv_obj_t * label11 = lv_label_create(parent);
    lv_label_set_long_mode(label11, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_label_set_text(label11, most_recent_book_title.c_str());
    lv_obj_set_style_text_font(label11, &ubuntu_regular_16, 0);
    lv_obj_set_width(label11, 230);
    lv_obj_set_style_text_align(label11, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label11, LV_ALIGN_CENTER, 0, -45);

    // Crear una etiqueta para mostrar el libro con más páginas leídas
    lv_obj_t * label2 = lv_label_create(parent);
    lv_label_set_long_mode(label2, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label2, "Libro con más páginas leídas");
    lv_obj_set_style_text_font(label2, &ubuntu_bold_16, 0);
    lv_obj_set_width(label2, 230);
    lv_obj_set_style_text_align(label2, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label2, LV_ALIGN_CENTER, 0, -12);

    lv_obj_t * label22 = lv_label_create(parent);
    lv_label_set_long_mode(label22, LV_LABEL_LONG_SCROLL_CIRCULAR);
    String label2_text = max_pages_book_title + " (" + String(max_pages) + " páginas)";
    lv_label_set_text(label22, label2_text.c_str());
    lv_obj_set_style_text_font(label22, &ubuntu_regular_16, 0);
    lv_obj_set_width(label22, 230);
    lv_obj_set_style_text_align(label22, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label22, LV_ALIGN_CENTER, 0, 8);

    // Crear una etiqueta para mostrar el total de páginas leídas
    lv_obj_t * label3 = lv_label_create(parent);
    lv_label_set_long_mode(label3, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label3, "Total de páginas leídas (entre todos los libros)");
    lv_obj_set_style_text_font(label3, &ubuntu_bold_16, 0);
    lv_obj_set_width(label3, 230);
    lv_obj_set_style_text_align(label3, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label3, LV_ALIGN_CENTER, 0, 50);

    lv_obj_t * label33 = lv_label_create(parent);
    lv_label_set_long_mode(label33, LV_LABEL_LONG_WRAP);
    String label3_text = String(total_pages) + " páginas";
    lv_label_set_text(label33, label3_text.c_str());
    lv_obj_set_style_text_font(label33, &ubuntu_regular_16, 0);
    lv_obj_set_width(label33, 230);
    lv_obj_set_style_text_align(label33, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_align(label33, LV_ALIGN_CENTER, 0, 80);

    // Botón para ir desplazándose más facilmente por la pantalla hacia abajo
    lv_obj_t * down_button1 = lv_btn_create(parent);
    lv_obj_set_size(down_button1, 20, 20);
    lv_obj_set_pos(down_button1, 90, 230);
    lv_obj_add_event_cb(down_button1, event_handler_scroll1, LV_EVENT_CLICKED, parent);

    lv_obj_t * down_symbol1 = lv_label_create(down_button1);
    lv_obj_center(down_symbol1);
    lv_label_set_text(down_symbol1, LV_SYMBOL_DOWN);

    // Botón para ir desplazándose más facilmente por la pantalla hacia abajo
    lv_obj_t * down_button2 = lv_btn_create(parent);
    lv_obj_set_size(down_button2, 20, 20);
    lv_obj_set_pos(down_button2, 90, 505);
    lv_obj_add_event_cb(down_button2, event_handler_scroll2, LV_EVENT_CLICKED, parent);

    lv_obj_t * down_symbol2 = lv_label_create(down_button2);
    lv_obj_center(down_symbol2);
    lv_label_set_text(down_symbol2, LV_SYMBOL_DOWN);

    // Botón para ir desplazándose más facilmente por la pantalla hacia abajo
    lv_obj_t * down_button3 = lv_btn_create(parent);
    lv_obj_set_size(down_button3, 20, 20);
    lv_obj_set_pos(down_button3, 90, 780);
    lv_obj_add_event_cb(down_button3, event_handler_scroll3, LV_EVENT_CLICKED, parent);

    lv_obj_t * down_symbol3 = lv_label_create(down_button3);
    lv_obj_center(down_symbol3);
    lv_label_set_text(down_symbol3, LV_SYMBOL_DOWN);

    // Botón para ir desplazándose más facilmente por la pantalla hacia arriba
    lv_obj_t * up_button = lv_btn_create(parent);
    lv_obj_set_size(up_button, 20, 20); // Set the size of the button
    lv_obj_set_pos(up_button, 90, 830); // Set the position of the button
    lv_obj_add_event_cb(up_button, event_handler_top, LV_EVENT_CLICKED, parent); // Set the click event handler

    lv_obj_t * up_symbol = lv_label_create(up_button);
    lv_obj_center(up_symbol);
    lv_label_set_text(up_symbol, LV_SYMBOL_UP);


    // Estilo para los botones de desplazamiento por la pantalla
    static lv_style_t style_symbol_up_down;
    lv_style_init(&style_symbol_up_down);
    lv_style_set_text_color(&style_symbol_up_down, lv_color_black());
    lv_obj_add_style(down_symbol1, &style_symbol_up_down, 0);
    lv_obj_add_style(down_symbol2, &style_symbol_up_down, 0);
    lv_obj_add_style(down_symbol3, &style_symbol_up_down, 0);
    lv_obj_add_style(up_symbol, &style_symbol_up_down, 0);

