ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
    // Color de fondo del botón
    static lv_style_t style_btn_up_down;
    lv_style_init(&style_btn_up_down);
    lv_style_set_bg_color(&style_btn_up_down, lv_color_hex(0xCEF2D8));
    lv_obj_add_style(down_button1, &style_btn_up_down, 0);
    lv_obj_add_style(down_button2, &style_btn_up_down, 0);
    lv_obj_add_style(down_button3, &style_btn_up_down, 0);
    lv_obj_add_style(up_button, &style_btn_up_down, 0);

    //Botón para ir a pantalla que muestra gráfica
    lv_obj_t * symbol = lv_label_create(parent);
    lv_label_set_text(symbol, "\xF3\xB0\x84\xA8");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(parent, symbol, BUTTON_STYLE_GREEN, go_to_screen2_tab4, 75, 1060);
}


// Manejador de eventos para el botón de desplazar la pantalla
void event_handler_scroll1(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e);
        lv_obj_scroll_to_y(screen2, 285, LV_ANIM_ON);
    }
}

// Manejador de eventos para el botón de desplazar la pantalla
void event_handler_scroll2(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e);
        lv_obj_scroll_to_y(screen2, 560, LV_ANIM_ON);
    }
}

// Manejador de eventos para el botón de desplazar la pantalla
void event_handler_scroll3(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e);
        lv_obj_scroll_to_y(screen2, 840, LV_ANIM_ON);
    }
}


// Segunda pantalla de pestaña 4 con la gráfica de barras
void create_second_screen_tab4(lv_obj_t * parent) {
    // Crear una nueva pantalla y cargarla
    lv_obj_t * screen2 = lv_obj_create(NULL);
    lv_obj_set_size(screen2, LV_HOR_RES, LV_VER_RES);
    lv_obj_set_style_bg_color(screen2, lv_color_hex(0xCEF2D8), 0);
    lv_scr_load(screen2);

    // Crear un gráfico de barras en la pantalla
    lv_obj_t * chart = lv_chart_create(screen2);

    // Posición y tamaño del gráfico
    lv_obj_set_pos(chart, 55, 370);
    lv_obj_set_size(chart, 160, 180);

    // Configuración del gráfico
    lv_chart_set_type(chart, LV_CHART_TYPE_BAR);
    lv_chart_set_range(chart, LV_CHART_AXIS_PRIMARY_Y, 0, 100); // Rango de 0 a 100
    lv_obj_add_event_cb(chart, draw_label_x_axis, LV_EVENT_DRAW_PART_BEGIN, NULL);
    lv_obj_add_event_cb(chart, draw_label_y_axis, LV_EVENT_DRAW_PART_BEGIN, NULL);

    // Configuración del eje Y
    lv_chart_set_axis_tick(chart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 2, true, 50);

    // Configuración de las líneas divisorias
    lv_chart_set_div_line_count(chart, 6, 0);

    // Zoom en el eje X
    lv_chart_set_zoom_x(chart, 500);

    // Crear una serie para el gráfico y establecer el color
    lv_chart_series_t * ser = lv_chart_add_series(chart, lv_palette_main(LV_PALETTE_LIGHT_GREEN), LV_CHART_AXIS_PRIMARY_Y);

    // Para que las etiquetas de los ejes aparezcan en negro y se vean mejor (antes en gris)
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_line_color(&style, lv_color_hex(0x000000));
    lv_style_set_text_color(&style, lv_color_hex(0x000000));
    lv_obj_add_style(chart, &style, LV_PART_TICKS);

    int book_index = 0;

    // Buscar en la base de datos
    DynamicJsonDocument doc = get_book_data();

    // Configuración del eje X
    lv_chart_set_axis_tick(chart, LV_CHART_AXIS_PRIMARY_X, 5, 5, doc.size(), 1, true, 50); // Set the tick count to the number of books

    // Establece el número de puntos en el gráfico al número de libros
    lv_chart_set_point_count(chart, doc.size());

    int label_y_pos = 30; // Inicializa la posición Y de la etiqueta para la primera etiqueta
    int legend_pos = 20; // Posición de las etiquetas de la leyenda

    // Crear un contenedor para las etiquetas de la leyenda
    lv_obj_t * container = lv_obj_create(screen2);
    lv_obj_set_size(container, 210, 250);
    lv_obj_set_style_bg_color(container, lv_color_hex(0xCEF2D8), LV_PART_MAIN);
    lv_obj_set_style_border_color(container, lv_color_hex(0x25B619), LV_PART_MAIN);
    lv_obj_set_style_border_width(container, 2, LV_PART_MAIN);
    lv_obj_set_pos(container, 13, legend_pos);

    // Botón para desplazar pantalla hacia abajo automáticamente
    lv_obj_t * down_button = lv_btn_create(screen2);
    lv_obj_set_size(down_button, 20, 20);
    lv_obj_set_pos(down_button, 110, 280);
    lv_obj_add_event_cb(down_button, event_handler_bottom, LV_EVENT_CLICKED, screen2);

    // Crear una etiqueta para el símbolo de abajo y añadir al botón
    lv_obj_t * down_symbol = lv_label_create(down_button);
    lv_obj_center(down_symbol);
    lv_label_set_text(down_symbol, LV_SYMBOL_DOWN);

    //Botón para desplazar pantalla hacia arriba automáticamente
    lv_obj_t * up_button = lv_btn_create(screen2);
    lv_obj_set_size(up_button, 20, 20);
    lv_obj_set_pos(up_button, 110, 330);
    lv_obj_add_event_cb(up_button, event_handler_top, LV_EVENT_CLICKED, screen2);

    // Crear una etiqueta para el símbolo de arriba y añadir al botón
    lv_obj_t * up_symbol = lv_label_create(up_button);
    lv_obj_center(up_symbol);
    lv_label_set_text(up_symbol, LV_SYMBOL_UP);


    // Crear estilo para los símbolos de arriba y abajo
    static lv_style_t style_symbol_up_down;
    lv_style_init(&style_symbol_up_down);
    lv_style_set_text_color(&style_symbol_up_down, lv_color_black());
    lv_obj_add_style(down_symbol, &style_symbol_up_down, 0);
    lv_obj_add_style(up_symbol, &style_symbol_up_down, 0);

    // Establecer el estilo del botón para que coincida con el color de fondo
    static lv_style_t style_btn_up_down;
    lv_style_init(&style_btn_up_down);
    lv_style_set_bg_color(&style_btn_up_down, lv_color_hex(0xCEF2D8));
    lv_obj_add_style(down_button, &style_btn_up_down, 0);
    lv_obj_add_style(up_button, &style_btn_up_down, 0);

    // Crear una etiqueta para la leyenda
    lv_obj_t * label = lv_label_create(container);
    lv_label_set_text(label, "-----------LEYENDA-----------");
    lv_obj_set_style_text_font(label, &ubuntu_bold_16, 0);
    lv_obj_set_pos(label, 0, 0);

    // Para cada libro, calcular el porcentaje de páginas leídas y añadir una serie al gráfico
    for(JsonPair kv : doc.as<JsonObject>()) {
        book_key = kv.key().c_str(); // Obtener la clave del libro
        book_keys.push_back(book_key.c_str()); // Almacenar la clave del libro para su uso posterior
        JsonObject libro = kv.value().as<JsonObject>(); // Obtener el valor del libro como un objeto JSON

        // Calcular el porcentaje de páginas leídas
        totalPages = libro["paginas_total"].as<int>();
        currentPage = libro["pagina_actual"].as<int>();
        float porcentaje = ((float)currentPage / totalPages) * 100;

        // Añadir el porcentaje a la serie del gráfico
        lv_chart_set_next_value(chart, ser, porcentaje);

        // Crear una etiqueta para la clave y añadirla al contenedor de leyenda
        lv_obj_t * label_key = lv_label_create(container);
        lv_label_set_text(label_key, book_key.c_str());
        lv_obj_set_style_text_font(label_key, &ubuntu_bold_16, 0);
        lv_obj_set_pos(label_key, 0, label_y_pos);

