ainhoamm04/Asistente_lectura_ESP32-S3/src/main.cpp
        // Crear una etiqueta para el título del libro y añadirla al contenedor de leyenda
        lv_obj_t * label_title = lv_label_create(container);
        lv_label_set_text(label_title, libro["titulo"].as<const char*>());
        lv_obj_set_style_text_font(label_title, &ubuntu_regular_16, 0);
        lv_obj_set_pos(label_title, 0, label_y_pos + 20);

        label_y_pos += 45;

        book_index++;
    }

    // Actualizar el gráfico
    lv_chart_refresh(chart);

    // Crear un botón para regresar a la pantalla principal de la pestaña 4
    lv_obj_t * symbol = lv_label_create(screen2);
    lv_label_set_text(symbol, "\xF3\xB0\xA9\x88");
    lv_obj_set_style_text_font(symbol, &bigger_symbols, 0);

    create_button(screen2, symbol, BUTTON_STYLE_GREEN, back_to_main_menu, 95, 580);

    lv_obj_t * space = lv_label_create(screen2);
    lv_label_set_text(space, "\n\n");
    lv_obj_align(space, LV_ALIGN_TOP_MID, 0, 590);
}


// Manejador de eventos para el botón que cambia a la pantalla secundaria de tab4
void go_to_screen2_tab4(lv_event_t * e) {
    lv_obj_t * main_screen = lv_scr_act(); // Obtén la pantalla principal (donde están las tabs)
    scr_principal = main_screen;
    create_second_screen_tab4(main_screen);
}


// Manejador de eventos para el botón de desplazar la pantalla hacia abajo
void event_handler_bottom(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e); // Obtener el objeto de la pantalla de los datos del evento
        lv_obj_scroll_to_y(screen2, lv_obj_get_height(screen2), LV_ANIM_ON); // Desplazar la pantalla hacia abajo
    }
}


// Manejador de eventos para el botón de desplazar la pantalla hacia arriba
void event_handler_top(lv_event_t * e) {
    const lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * screen2 = (lv_obj_t *)lv_event_get_user_data(e); // Obtener el objeto de la pantalla de los datos del evento
        lv_obj_scroll_to_y(screen2, 0, LV_ANIM_ON); // Desplazar la pantalla hacia arriba
    }
}


// Función para dibujar las etiquetas del eje X (las claves de los libros)
void draw_label_x_axis(lv_event_t * e) {
    lv_obj_draw_part_dsc_t * dsc = lv_event_get_draw_part_dsc(e);
    if(!lv_obj_draw_part_check_type(dsc, &lv_chart_class, LV_CHART_DRAW_PART_TICK_LABEL)) return;

    if(dsc->id == LV_CHART_AXIS_PRIMARY_X && dsc->text) {
        lv_snprintf(dsc->text, dsc->text_length, "%s", book_keys[dsc->value % book_keys.size()].c_str());
    }
}


// Función para dibujar las etiquetas del eje Y (los porcentajes de páginas leídas)
void draw_label_y_axis(lv_event_t * e) {
    lv_obj_draw_part_dsc_t * dsc = lv_event_get_draw_part_dsc(e);
    if(!lv_obj_draw_part_check_type(dsc, &lv_chart_class, LV_CHART_DRAW_PART_TICK_LABEL)) return;

    if(dsc->id == LV_CHART_AXIS_PRIMARY_Y && dsc->text) {
        lv_snprintf(dsc->text, dsc->text_length, "%d%%", dsc->value);
    }
}